<a href="https://colab.research.google.com/github/hariprakash2109/Data_analyst/blob/main/data_analyast.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
s=pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
s.dtype

dtype('int64')

In [7]:
s.values

array([10, 20, 30, 40, 50])

In [8]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
print(s.name)

None

In [19]:
s.name="Calories"
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: Calories, dtype: int64

In [12]:
s[0]

np.int64(10)

In [20]:
s[0:2]

apple     10
banana    20
Name: Calories, dtype: int64

In [21]:
s[2:4]

grapes    30
orange    40
Name: Calories, dtype: int64

In [15]:
s.iloc[3]

np.int64(40)

In [16]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: Numbers, dtype: int64

In [17]:
index = ["apple","banana","grapes","orange","strawberry"]

In [22]:
s.index = index
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: Calories, dtype: int64

In [23]:
s['grapes']

np.int64(30)

In [24]:
s.iloc[3]

np.int64(40)

In [25]:
s.loc['grapes']

np.int64(30)

In [26]:
s['banana':'orange']

banana    20
grapes    30
orange    40
Name: Calories, dtype: int64

In [27]:
fruit_protein = {
    "Avocado": 2.0,
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [28]:
s2 = pd.Series(fruit_protein)
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
dtype: float64

In [37]:
s3 = pd.Series(fruit_protein, name="Protein")
s3

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [36]:
s3>1

Avocado          True
Guava            True
Blackberries     True
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
Name: Protein, dtype: bool

In [39]:
s3[s3>1]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [40]:
[(s3>0.5) & (s3<2)]

[Avocado         False
 Guava           False
 Blackberries    False
 Oranges          True
 Banana           True
 Apples          False
 Kiwi             True
 Pomegranate      True
 Mango            True
 Cherries         True
 Name: Protein, dtype: bool]